[
  "dataview",
  "templater-obsidian",
  "obsidian-tasks-plugin",
  "obsidian-kanban",
  "calendar",
  "tag-wrangler",
  "periodic-notes",
  "nldates-obsidian",
  "obsidian-pandoc",
  "obsidian-charts",
  "hotkeysplus-obsidian",
  "smart-random-note",
  "table-editor-obsidian"
]