Codes/Laravel/laravel9/app/Http/Controllers/PostController.php

select `posts`.*, `users`.`name` as `author_name` from `posts` inner join `users` on `posts`.`author_id` = `users`.`id` order by `posts`.`created_at` desc limit 4 offset 0
select count(*) as aggregate from `posts` inner join `users` on `posts`.`author_id` = `users`.`id`
---
    public function index(Request $request)
    {
        if ($request->search) {
            $posts = Post::join('users', 'posts.author_id', '=', 'users.id')
                ->where('title', 'like', '%'.$request->search.'%')
                ->orWhere('descr', 'like', '%'.$request->search.'%')
                ->orWhere('name', 'like', '%'.$request->search.'%')
                ->orderBy('posts.created_at', 'desc')
                ->select('posts.*', 'users.name as author_name')
                ->paginate(4)
                ->withQueryString();
            return view('posts.index', compact('posts'));
        }


        $posts = Post::join('users', 'posts.author_id', '=', 'users.id')
            ->orderBy('posts.created_at', 'desc')
            ->select('posts.*', 'users.name as author_name')
            ->paginate(4);

select `posts`.*, `users`.`name` as `author_name` from `posts` inner join `users` on `posts`.`author_id` = `users`.`id` where `posts`.`post_id` = '22' limit 1
---
    public function show($id)
    {
        $post = Post::join('users', 'posts.author_id', '=', 'users.id')
            ->select('posts.*', 'users.name as author_name')
            ->where('posts.post_id', $id)
            ->first();